# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "nicoverbruggen/homebrew-cask"
tap "shivammathur/extensions"
tap "shivammathur/php"

# Binaries
brew "dnsmasq"
brew "git"
brew "jq"
brew "gnupg"
brew "nginx"
brew "node"
brew "nvm"
brew "php"
brew "php@8.1"
brew "php@8.2"
brew "pinentry-mac"
brew "pnpm"
brew "redis"
brew "shivammathur/extensions/xdebug@8.2"
brew "shivammathur/extensions/xdebug@8.4"
brew "shivammathur/php/php@8.4"
brew "stripe/stripe-cli/stripe"

# Apps
cask "appcleaner"
cask "dbngin"
cask "discord"
cask "github"
cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "microsoft-edge"
cask "ngrok"
cask "onyx"
cask "phpmon"
cask "phpstorm"
cask "redisinsight"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"

# VS Code
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "calebporzio.better-keybindings"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "loilo.snazzy-light"
vscode "mehedidracula.php-namespace-resolver"
vscode "mrmlnc.vscode-duplicate"
vscode "rebornix.toggle"
vscode "sdras.vue-vscode-snippets"
vscode "vue.volar"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
